In [2]:
!ls

LICENSE        Untitled.ipynb file.db
README.md      db.db          premium

In [34]:
from dateutil.relativedelta import relativedelta

In [50]:
import numpy as np

In [3]:
import sqlite3
import pandas as pd
# Create your connection.
cnx = sqlite3.connect('db.db')

df = pd.read_sql_query("SELECT * FROM premium_payments", cnx)

In [4]:
df.head()

   member_id                  date_start                    date_end  type
0          1  2018-10-31 00:00:00.000000  2018-11-30 00:00:00.000000     1
1          1  2018-12-01 00:00:00.000000  2019-01-01 00:00:00.000000     1
2          2  2019-01-18 00:00:00.000000  2019-02-17 00:00:00.000000     3
3          2  2019-02-19 00:00:00.000000  2019-03-22 00:00:00.000000     3
4          2  2019-03-23 00:00:00.000000  2019-04-23 00:00:00.000000     3

In [5]:
df.shape

(24999, 4)

In [6]:
df.dtypes

member_id      int64
date_start    object
date_end      object
type           int64
dtype: object

In [10]:
df['date_start'] = pd.to_datetime(df['date_start'])
df['date_end'] = pd.to_datetime(df['date_end'])

In [11]:
df

       member_id date_start   date_end  type
0              1 2018-10-31 2018-11-30     1
1              1 2018-12-01 2019-01-01     1
2              2 2019-01-18 2019-02-17     3
3              2 2019-02-19 2019-03-22     3
4              2 2019-03-23 2019-04-23     3
...          ...        ...        ...   ...
24994       9998 2019-06-05 2019-07-05     2
24995       9998 2019-09-03 2019-10-04     1
24996       9998 2019-10-04 2019-11-04     1
24997       9998 2019-11-06 2019-12-07     1
24998       9999 2019-03-14 2019-04-13     1

[24999 rows x 4 columns]

In [25]:
df.member_id.value_counts()

5000    4
9148    4
1553    4
7393    4
4740    4
       ..
3149    1
3180    1
8262    1
3194    1
9999    1
Name: member_id, Length: 9999, dtype: int64

In [ ]:
# id 1553 get differents type of premium

In [28]:
df[df['member_id'] == 1553]

      member_id date_start   date_end  type
3872       1553 2018-12-12 2019-01-11     3
3873       1553 2019-01-12 2019-02-12     3
3874       1553 2019-02-13 2019-03-16     1
3875       1553 2019-03-17 2019-04-17     1

In [29]:
sample = df[df['member_id'] == 1553]

In [30]:
sample

      member_id date_start   date_end  type
3872       1553 2018-12-12 2019-01-11     3
3873       1553 2019-01-12 2019-02-12     3
3874       1553 2019-02-13 2019-03-16     1
3875       1553 2019-03-17 2019-04-17     1

In [32]:
sample['test'] = sample.groupby(['member_id', 'type'])['date_end'].shift(1)

/var/folders/fl/h6ctphtx4p7ghm5xz95qz48c0000gn/T/ipykernel_10352/2574488455.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sample['test'] = sample.groupby(['member_id', 'type'])['date_end'].shift(1)

In [33]:
sample

      member_id date_start   date_end  type       test
3872       1553 2018-12-12 2019-01-11     3        NaT
3873       1553 2019-01-12 2019-02-12     3 2019-01-11
3874       1553 2019-02-13 2019-03-16     1        NaT
3875       1553 2019-03-17 2019-04-17     1 2019-03-16

In [39]:
sample['date_start'].min()

Timestamp('2018-12-12 00:00:00')

In [ ]:
#df.merge(df.groupby(['C', 'D']).apply(lambda row: row['B'] - row['A']).sum(level=[0,1]).reset_index())

In [40]:
sample.groupby(['member_id', 'type']).apply(lambda row: row['date_end'].max()-row['date_start'].min())

member_id  type
1553       1      63 days
           3      62 days
dtype: timedelta64[ns]

In [43]:
sample.groupby(['member_id', 'type']).transform(lambda row: row['date_end'].max()-row['date_start'].min())

KeyError: 'date_end'

In [41]:
result = sample.groupby(['member_id', 'type']).apply(lambda row: row['date_end'].max()-row['date_start'].min())

In [42]:
result

member_id  type
1553       1      63 days
           3      62 days
dtype: timedelta64[ns]

In [ ]:
sample['relativedelta'] =

In [51]:
sample['transaction_class'] = np.where(sample['date_start']+pd.Timedelta(3, unit='D')<sample['test'], 'other_transaction', 'same transaction')

/var/folders/fl/h6ctphtx4p7ghm5xz95qz48c0000gn/T/ipykernel_10352/2023327600.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sample['transaction_class'] = np.where(sample['date_start']+pd.Timedelta(3, unit='D')<sample['test'], 'other_transaction', 'same transaction')

In [52]:
sample

,member_id,date_start,date_end,type,test,test_bis,transaction_class
3872,1553,2018-12-12,2019-01-11,3,NaT,NaT,same transaction
3873,1553,2019-01-12,2019-02-12,3,2019-01-11,1 days,same transaction
3874,1553,2019-02-13,2019-03-16,1,NaT,NaT,same transaction
3875,1553,2019-03-17,2019-04-17,1,2019-03-16,1 days,same transaction

In [53]:
sample.groupby(['member_id', 'type', 'transaction_class']).agg({
    'date_start': min,
    'date_end': max
})

                                 date_start   date_end
member_id type transaction_class
1553      1    same transaction  2019-02-13 2019-04-17
          3    same transaction  2018-12-12 2019-02-12

In [37]:
sample['test_bis'] = sample['date_start'] - sample['test']

/var/folders/fl/h6ctphtx4p7ghm5xz95qz48c0000gn/T/ipykernel_10352/3843121957.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sample['test_bis'] = sample['date_start'] - sample['test']

In [38]:
sample

      member_id date_start   date_end  type       test test_bis
3872       1553 2018-12-12 2019-01-11     3        NaT      NaT
3873       1553 2019-01-12 2019-02-12     3 2019-01-11   1 days
3874       1553 2019-02-13 2019-03-16     1        NaT      NaT
3875       1553 2019-03-17 2019-04-17     1 2019-03-16   1 days

In [47]:
sample['test_bis'] + pd.Timedelta(3, unit='D')

3872      NaT
3873   4 days
3874      NaT
3875   4 days
Name: test_bis, dtype: timedelta64[ns]

In [55]:
experiment = df.copy()

In [62]:
# get number of members
df.member_id.nunique()

9999

In [67]:
def _group_transaction(df):
    df['end_date_alg'] = df.groupby(['member_id', 'type'])['date_end'].shift(1)
    return np.where(df['date_start']+pd.Timedelta(3, unit='D')<df['end_date_alg'], 'other_transaction', 'same transaction')

In [68]:
df['date_start']+pd.Timedelta(3, unit='D')

0       2018-11-03
1       2018-12-04
2       2019-01-21
3       2019-02-22
4       2019-03-26
           ...
24994   2019-06-08
24995   2019-09-06
24996   2019-10-07
24997   2019-11-09
24998   2019-03-17
Name: date_start, Length: 24999, dtype: datetime64[ns]

In [64]:
experiment['transaction_class'] = _group_transaction(experiment)

In [65]:
experiment

       member_id date_start   date_end  type end_date_alg transaction_class
0              1 2018-10-31 2018-11-30     1          NaT  same transaction
1              1 2018-12-01 2019-01-01     1   2018-11-30  same transaction
2              2 2019-01-18 2019-02-17     3          NaT  same transaction
3              2 2019-02-19 2019-03-22     3   2019-02-17  same transaction
4              2 2019-03-23 2019-04-23     3   2019-03-22  same transaction
...          ...        ...        ...   ...          ...               ...
24994       9998 2019-06-05 2019-07-05     2          NaT  same transaction
24995       9998 2019-09-03 2019-10-04     1          NaT  same transaction
24996       9998 2019-10-04 2019-11-04     1   2019-10-04  same transaction
24997       9998 2019-11-06 2019-12-07     1   2019-11-04  same transaction
24998       9999 2019-03-14 2019-04-13     1          NaT  same transaction

[24999 rows x 6 columns]

In [66]:
experiment.transaction_class.value_counts()

same transaction    24999
Name: transaction_class, dtype: int64

In [70]:
result = experiment.groupby(['member_id', 'type', 'transaction_class']).agg({
    'date_start': min,
    'date_end': max
})

In [71]:
result

                                 date_start   date_end
member_id type transaction_class
1         1    same transaction  2018-10-31 2019-01-01
2         3    same transaction  2019-01-18 2019-04-23
3         3    same transaction  2019-03-30 2019-07-29
4         2    same transaction  2019-11-29 2020-03-16
5         3    same transaction  2019-11-28 2020-01-29
...                                     ...        ...
9997      1    same transaction  2019-01-07 2019-06-09
          2    same transaction  2019-02-08 2019-03-11
9998      1    same transaction  2019-09-03 2019-12-07
          2    same transaction  2019-06-05 2019-07-05
9999      1    same transaction  2019-03-14 2019-04-13

[12725 rows x 2 columns]

In [75]:
result.columns

Index(['date_start', 'date_end'], dtype='object')

In [76]:
result.index

MultiIndex([(   1, 1, 'same transaction'),
            (   2, 3, 'same transaction'),
            (   3, 3, 'same transaction'),
            (   4, 2, 'same transaction'),
            (   5, 3, 'same transaction'),
            (   6, 2, 'same transaction'),
            (   7, 1, 'same transaction'),
            (   7, 3, 'same transaction'),
            (   8, 1, 'same transaction'),
            (   9, 1, 'same transaction'),
            ...
            (9993, 1, 'same transaction'),
            (9994, 1, 'same transaction'),
            (9994, 3, 'same transaction'),
            (9995, 3, 'same transaction'),
            (9996, 1, 'same transaction'),
            (9997, 1, 'same transaction'),
            (9997, 2, 'same transaction'),
            (9998, 1, 'same transaction'),
            (9998, 2, 'same transaction'),
            (9999, 1, 'same transaction')],
           names=['member_id', 'type', 'transaction_class'], length=12725)

In [78]:
result.reset_index(level='transaction_class').drop('transaction_class', axis=1)

               date_start   date_end
member_id type
1         1    2018-10-31 2019-01-01
2         3    2019-01-18 2019-04-23
3         3    2019-03-30 2019-07-29
4         2    2019-11-29 2020-03-16
5         3    2019-11-28 2020-01-29
...                   ...        ...
9997      1    2019-01-07 2019-06-09
          2    2019-02-08 2019-03-11
9998      1    2019-09-03 2019-12-07
          2    2019-06-05 2019-07-05
9999      1    2019-03-14 2019-04-13

[12725 rows x 2 columns]

In [85]:
final_result = result.reset_index().drop('transaction_class', axis=1)

In [86]:
final_result

       member_id  type date_start   date_end
0              1     1 2018-10-31 2019-01-01
1              2     3 2019-01-18 2019-04-23
2              3     3 2019-03-30 2019-07-29
3              4     2 2019-11-29 2020-03-16
4              5     3 2019-11-28 2020-01-29
...          ...   ...        ...        ...
12720       9997     1 2019-01-07 2019-06-09
12721       9997     2 2019-02-08 2019-03-11
12722       9998     1 2019-09-03 2019-12-07
12723       9998     2 2019-06-05 2019-07-05
12724       9999     1 2019-03-14 2019-04-13

[12725 rows x 4 columns]

In [87]:
final_result.member_id.value_counts()

9637    3
3633    3
9378    3
758     3
332     3
       ..
3800    1
3799    1
3798    1
3797    1
9999    1
Name: member_id, Length: 9999, dtype: int64

In [88]:
final_result[final_result['member_id']==9637]

       member_id  type date_start   date_end
12258       9637     1 2018-08-07 2018-09-07
12259       9637     2 2018-06-03 2018-08-05
12260       9637     3 2018-10-23 2018-11-23